# HTML
read_html: https://pandas.pydata.org/docs/reference/api/pandas.read_html.html

In [1]:
import pandas as pd

In [2]:
url = 'https://en.wikipedia.org/wiki/List_of_highest-grossing_films'

In [3]:
movies = pd.read_html(url)

In [4]:
movies[2].head()

,Year,Title,Worldwide gross,Budget,Reference(s)
0,1915,The Birth of a Nation,"$50,000,000–100,000,000$20,000,000+R ($5,200,0...","$110,000",[# 82][# 83][# 84]
1,1916,Intolerance,"$1,000,000*R IN","$489,653",[# 85][# 86]
2,1917,Cleopatra,"$500,000*R","$300,000",[# 85]
3,1918,Mickey,"$8,000,000","$250,000",[# 87]
4,1919,The Miracle Man,"$3,000,000R","$120,000",[# 88]

In [5]:
# Specify match argument to filter results based on text matching the target table

movies = pd.read_html(url, match='High-grossing films by year of release')

In [6]:
type(movies)

list

In [7]:
movies[0].head()

,Year,Title,Worldwide gross,Budget,Reference(s)
0,1915,The Birth of a Nation,"$50,000,000–100,000,000$20,000,000+R ($5,200,0...","$110,000",[# 82][# 83][# 84]
1,1916,Intolerance,"$1,000,000*R IN","$489,653",[# 85][# 86]
2,1917,Cleopatra,"$500,000*R","$300,000",[# 85]
3,1918,Mickey,"$8,000,000","$250,000",[# 87]
4,1919,The Miracle Man,"$3,000,000R","$120,000",[# 88]